Catalogs/Образцы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Образцы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Единица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/НастройкиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БазаЗнанийЛогин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаЗнанийПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорпоративныйАккаунт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Софт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Софт</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Софт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Квалификация</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Образцы/Ext/ManagerModule.bsl
Функция ПолучитьДанныеОбразца(Образец) Экспорт
	
	ДанныеОбразца = Новый Структура("Материалы, Наименование, Обработка, Код, ШК", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Образцы.Наименование КАК Наименование,
		|	Образцы.Обработка КАК Обработка,
		|	Образцы.Код КАК Код
		|ИЗ
		|	Справочник.Образцы КАК Образцы
		|ГДЕ
		|	Образцы.Ссылка = &Образец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбразецМатериалы.Количество КАК Количество,
		|	ОбразецМатериалы.Примечание КАК Примечание,
		|	ОбразецМатериалы.Номенклатура.Представление КАК Номенклатура,
		|	ОбразецМатериалы.Единица.Представление КАК Единица
		|ИЗ
		|	Справочник.Образцы.Материалы КАК ОбразецМатериалы
		|ГДЕ
		|	ОбразецМатериалы.Ссылка = &Образец";
	
	Запрос.УстановитьПараметр("Образец", Образец);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеОбразца, Выборка);
		ДанныеОбразца.ШК = омШрихкодыНаСереверКлиенте.ПолучитьПрефиксШтрихкодаПоТипу(Образец) + Формат(Выборка.Код, "ЧЦ=9; ЧВН=; ЧГ=0");
		
		ДанныеОбразца.Наименование = СтрЗаменить(ДанныеОбразца.Наименование, Символы.ВК, "");
		ДанныеОбразца.Наименование = СтрЗаменить(ДанныеОбразца.Наименование, Символы.ПС, "");
		ДанныеОбразца.Наименование = "Образец № " + Формат(ДанныеОбразца.Код ,"ЧГ=0") + " " + ДанныеОбразца.Наименование;
		
		ДанныеОбразца.Обработка = СтрЗаменить(ДанныеОбразца.Обработка, Символы.ВК, ""); 
		ДанныеОбразца.Обработка = СтрЗаменить(ДанныеОбразца.Обработка, Символы.ПС, "");
		
	КонецЦикла;
	
	Выборка = РезультатЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураДаныеМатериала = Новый Структура("Номенклатура, Единица, Примечание, Количество", );
		ЗаполнитьЗначенияСвойств(СтруктураДаныеМатериала, Выборка);
		ДанныеОбразца.Материалы.Добавить(СтруктураДаныеМатериала);
		
	КонецЦикла;
	
    Возврат ДанныеОбразца;
КонецФункции // ПолучитьДанныеОбразца()

Функция ПолучитьСтркутуруНастроекПечати() Экспорт

	СтруктураНастроекПечати = Новый Структура();
	
	СтруктураНастроекПечати.Вставить("ТекстНаименование", 			"");
	СтруктураНастроекПечати.Вставить("РазмерШрифтаНаименования", 	10);
	СтруктураНастроекПечати.Вставить("РазмерШКпоВысоте", 			5);
	СтруктураНастроекПечати.Вставить("РазмерШКпоШирине", 			12);
	СтруктураНастроекПечати.Вставить("РазмерШрифтаОбработка",		8);
	СтруктураНастроекПечати.Вставить("РазмерШрифтаМатериалы", 		8);
	СтруктураНастроекПечати.Вставить("ПолужирныйНаименование", 		Истина);
	СтруктураНастроекПечати.Вставить("Материалы",					Истина);
	СтруктураНастроекПечати.Вставить("Наименование", 				Истина);
	СтруктураНастроекПечати.Вставить("Обработка",					Истина);
	СтруктураНастроекПечати.Вставить("ВыводитьРамку", 				Истина);
	СтруктураНастроекПечати.Вставить("ТекстНаШтрихКоде", 			Истина);
	СтруктураНастроекПечати.Вставить("ВыводитьШК", 					Истина);
	СтруктураНастроекПечати.Вставить("ПолужирныйОбработка", 		Ложь);
	СтруктураНастроекПечати.Вставить("ПолужирныйМатериалы", 		Ложь);
	
	
	Возврат СтруктураНастроекПечати;

КонецФункции // ПолучитьСтркутураНстроекПечати()    

Функция ПолучитьВариантыНастроек() Экспорт

	Префикс = ПолучитьПрефикс();

	ВариантыНастроек = Новый Структура();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.Значение КАК НаименованиеВарианта,
		|	НастройкиПроектаВарианты.Значение КАК Значение,
		|	НастройкиПроектаВарианты.ИмяНастройки КАК ИмяНастройки
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПроекта КАК НастройкиПроектаВарианты
		|		ПО НастройкиПроекта.НомерНастройки = НастройкиПроектаВарианты.НомерНастройки
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = ""ВариантыНастроекПечатиОбразцов""
		|	И НастройкиПроектаВарианты.ИмяНастройки В(&МассивНастроекПечатьОбразца)";
	
	Запрос.УстановитьПараметр("МассивНастроекПечатьОбразца", ПолучитьМассивНастроекПечатьОбразца());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаименованиеВарианта = Выборка.НаименованиеВарианта;
		
		Если НЕ ВариантыНастроек.Свойство(НаименованиеВарианта) Тогда
			ВариантыНастроек.Вставить(НаименованиеВарианта, ПолучитьСтркутуруНастроекПечати());
		КонецЕсли;
		
		ВариантыНастроек[НаименованиеВарианта][СтрЗаменить(Выборка.ИмяНастройки, Префикс, "")] = Выборка.Значение;
		
	КонецЦикла;
	
	Возврат ВариантыНастроек;

КонецФункции // ПолучитьСтркутураНстроекПечати() 

Функция ПолучитьМассивВариантыНастроек() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.Значение КАК НаименованиеВарианта
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = ""ВариантыНастроекПечатиОбразцов""
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаименованиеВарианта";
	
	
    Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НаименованиеВарианта");

КонецФункции // ПолучитьМассивВариантыНастроек()


Функция ПолучитьВариантНастройки(ИмяВарианта) Экспорт

	Префикс = ПолучитьПрефикс();

	ВариантНастройки = ПолучитьСтркутуруНастроекПечати();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.Значение КАК НаименованиеВарианта,
		|	НастройкиПроектаВарианты.Значение КАК Значение,
		|	НастройкиПроектаВарианты.ИмяНастройки КАК ИмяНастройки
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПроекта КАК НастройкиПроектаВарианты
		|		ПО НастройкиПроекта.НомерНастройки = НастройкиПроектаВарианты.НомерНастройки
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = ""ВариантыНастроекПечатиОбразцов""
		|	И (ВЫРАЗИТЬ(НастройкиПроекта.Значение КАК СТРОКА(100))) = &ИмяВарианта
		|	И НастройкиПроектаВарианты.ИмяНастройки В(&МассивНастроекПечатьОбразца)";
	
	Запрос.УстановитьПараметр("ИмяВарианта", ИмяВарианта);
	Запрос.УстановитьПараметр("МассивНастроекПечатьОбразца", ПолучитьМассивНастроекПечатьОбразца());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ВариантНастройки[СтрЗаменить(Выборка.ИмяНастройки, Префикс, "")] = Выборка.Значение;
		
	КонецЦикла;
	
	Возврат ВариантНастройки;

КонецФункции // ПолучитьСтркутураНстроекПечати() 

Функция ПолучитьМассивНастроекПечатьОбразца() Экспорт
	
	Префикс = ПолучитьПрефикс();
	
	СтркутуруНастроекПечати = ПолучитьСтркутуруНастроекПечати();
	
	КоличествоНастроек = СтркутуруНастроекПечати.Количество();
	
	МассивНаименованиеНастроекШильдика = Новый Массив(КоличествоНастроек); 
	ИндексМассива = 0;
	
	Для каждого х Из СтркутуруНастроекПечати Цикл
		
		Если НЕ х.Ключ = "ТекстНаименование" Тогда
			
			МассивНаименованиеНастроекШильдика[ИндексМассива] = Префикс + х.Ключ;
			ИндексМассива = ИндексМассива + 1;
			
		КонецЕсли;

		
	КонецЦикла;
	
	Возврат МассивНаименованиеНастроекШильдика;
	
	
КонецФункции // ПолучитьМассивНастроекПечатьОбразца()

Функция ПолучитьПрефикс()

	Возврат "ПечатьШильдика_";

КонецФункции // ПолучитьПрефикс()


Функция СформироватьТаблицуНаСервере(Образец, СтркутураНастроекПечати, Пример, ДанныеОбразца = Неопределено) Экспорт
	
	Если ДанныеОбразца = Неопределено Тогда
		ДанныеОбразца = ПолучитьДанныеОбразца(Образец);	
	КонецЕсли;
	
	Пример.Очистить();
	СтруктрураОбъеденненыхЯчеек = Новый Структура("Наименование, Обработка, Материалы, МаксимальнаяШирина", 2, 2, 2, 5);
	
	мШиринаКолонок = Новый Массив(?(СтркутураНастроекПечати.Материалы, 5, 2));
	мШиринаКолонок[0] = 1;
	мШиринаКолонок[1] = 20;
	
	Если СтркутураНастроекПечати.Материалы Тогда
		мШиринаКолонок[2] = 6;
		мШиринаКолонок[3] = 6;
		мШиринаКолонок[4] = 30;
	КонецЕсли;
	
	стПараметровОбласти = омТабличныйДокументКлиентСервер.ПолучитьСтруктуруПараметров(Истина);
	стПараметровОбласти.НомерСтроки 			= 2;
	стПараметровОбласти.НомерКолонки 			= 2;
	стПараметровОбласти.ДлинаОбласти 			= СтруктрураОбъеденненыхЯчеек.Наименование;
	стПараметровОбласти.ВысотаОбласти 			= 1;
	стПараметровОбласти.РазмерШрифта 			= СтркутураНастроекПечати.РазмерШрифтаНаименования; 
	стПараметровОбласти.Полужирный     			= СтркутураНастроекПечати.ПолужирныйНаименование; 
	стПараметровОбласти.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	стПараметровОбласти.РазмещениеТекста 		= ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	Если СтркутураНастроекПечати.Наименование Тогда
		Пример.Вывести(ПолучитьТаблицуНаименовнаия(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок, СтркутураНастроекПечати));
	КонецЕсли;
	
	Если СтркутураНастроекПечати.ВыводитьШК Тогда
		Пример.Вывести(ПолучитьШК(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, СтркутураНастроекПечати));
	КонецЕсли;
	
	Если СтркутураНастроекПечати.Обработка Тогда
		стПараметровОбласти.РазмерШрифта 		= СтркутураНастроекПечати.РазмерШрифтаОбработка; 
		стПараметровОбласти.Полужирный     		= СтркутураНастроекПечати.ПолужирныйОбработка; 
		Пример.Вывести(ПолучитьТаблицуОбработка(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок));
	КонецЕсли;
	
	Если СтркутураНастроекПечати.Материалы Тогда
		стПараметровОбласти.РазмерШрифта 		= СтркутураНастроекПечати.РазмерШрифтаМатериалы; 
		стПараметровОбласти.Полужирный     		= СтркутураНастроекПечати.ПолужирныйМатериалы;
		стПараметровОбласти.РазмещениеТекста	= ТипРазмещенияТекстаТабличногоДокумента.Обрезать;
		Пример.Вывести(ПолучитьТаблицуМатериалы(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок));
	КонецЕсли;
	
	Если СтркутураНастроекПечати.ВыводитьРамку Тогда
		омТабличныйДокументКлиентСервер.ОбвестиОбласть(Пример);	
	КонецЕсли;
	
Конецфункции

Функция ПолучитьТаблицуМатериалы(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок)

	ТабДок = Новый ТабличныйДокумент;
	Если ДанныеОбразца.Материалы.Количество() = 0 Тогда
	    Возврат ТабДок;
	КонецЕсли;
	
	ЛинияГраницы = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1); 
	стПараметровОбласти.ГраницаСлева			= ЛинияГраницы;
	стПараметровОбласти.ГраницаСправа			= ЛинияГраницы;
	стПараметровОбласти.ГраницаСверху			= ЛинияГраницы;
	стПараметровОбласти.ГраницаСнизу			= ЛинияГраницы;
	стПараметровОбласти.ЦветРамки				= "000000000";
	стПараметровОбласти.ДлинаОбласти 			= 1;		
	
	Для х = 0 По ДанныеОбразца.Материалы.Количество() - 1 Цикл
		
		ДанныеСтроки = ДанныеОбразца.Материалы[х];
		
		стПараметровОбласти.НомерКолонки = 2;
		стПараметровОбласти.Текст 		= ДанныеСтроки.Номенклатура;
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		стПараметровОбласти.НомерКолонки = 3;
		стПараметровОбласти.Текст 		= ДанныеСтроки.Количество;
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		стПараметровОбласти.НомерКолонки = 4;
		стПараметровОбласти.Текст 		= ДанныеСтроки.Единица;
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		стПараметровОбласти.НомерКолонки = 5;
		стПараметровОбласти.Текст 		= ДанныеСтроки.Примечание;
		омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		
		стПараметровОбласти.НомерСтроки = стПараметровОбласти.НомерСтроки + 1;
		
	КонецЦикла;
	
	Возврат ТабДок;

КонецФункции // ПолучитьТаблицуНаименовнаия()

Функция ПолучитьТаблицуОбработка(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок)

	ПоискРазмера = Истина;
	РазмерНайден = Ложь;
	ПоследнийРаз = Ложь;
	
	Пока ПоискРазмера Цикл
		
		Если ПоследнийРаз Тогда
			ПоискРазмера = Ложь;
		КонецЕсли;
		
		ТабДок = Новый ТабличныйДокумент;
		омТабличныйДокументКлиентСервер.УстановитьШиринуКолонок(ТабДок, мШиринаКолонок);
		Область = омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		ВысотаПустойОбласти = ВысотаОбластиВмм(Область, ТабДок);
		Область.Текст 		= ДанныеОбразца.Обработка;
		
		Если ПоискРазмера Тогда
			
			ВысотаСТекстом = ВысотаОбластиВмм(Область, ТабДок);
			
			Если ВысотаПустойОбласти < ВысотаСТекстом Тогда
				СтруктрураОбъеденненыхЯчеек.Обработка = СтруктрураОбъеденненыхЯчеек.Обработка + 1;
				Если СтруктрураОбъеденненыхЯчеек.Обработка > СтруктрураОбъеденненыхЯчеек.МаксимальнаяШирина Тогда
					Прервать;	
				КонецЕсли;

				Если РазмерНайден Тогда
					ПоследнийРаз = Истина;
				КонецЕсли;
				
			Иначе
				Если СтруктрураОбъеденненыхЯчеек.Обработка = 1 Тогда
					Прервать;	
				КонецЕсли;
				РазмерНайден = Истина;
				СтруктрураОбъеденненыхЯчеек.Обработка = СтруктрураОбъеденненыхЯчеек.Обработка - 1;
			КонецЕсли;
			
			стПараметровОбласти.ДлинаОбласти = СтруктрураОбъеденненыхЯчеек.Обработка;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции // ПолучитьТаблицуНаименовнаия()

Функция ПолучитьШК(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, СтркутураНастроекПечати)
	
	КоличествоМиллиметровВПикселе = омТабличныйДокументСерверПовтор.ПолучитьКоличествоМиллиметровВПикселе();
	ТабДок = Новый ТабличныйДокумент;
	
	РисунокШтрихкода = ТабДок.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка); 
	РисунокШтрихкода.ВыводитьНаПечать 		= Истина;
	РисунокШтрихкода.Высота					= СтркутураНастроекПечати.РазмерШКпоВысоте / КоличествоМиллиметровВПикселе;
	РисунокШтрихкода.Ширина					= СтркутураНастроекПечати.РазмерШКпоШирине / КоличествоМиллиметровВПикселе; 
	
	
	ПараметрыШтрихкода = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
	ПараметрыШтрихкода.Ширина 				= Окр(РисунокШтрихкода.Ширина * 3);
	ПараметрыШтрихкода.Высота 				= Окр(РисунокШтрихкода.Высота * 3);
	ПараметрыШтрихкода.Штрихкод				= ДанныеОбразца.ШК;
	ПараметрыШтрихкода.ТипКода 				= 4;
	ПараметрыШтрихкода.РазмерШрифта 		= 14;
	ПараметрыШтрихкода.СохранятьПропорции 	= Истина;
	ПараметрыШтрихкода.ОтображатьТекст 		= СтркутураНастроекПечати.ТекстНаШтрихКоде;
	
	РисунокШтрихкода.Картинка 		= ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода).Картинка;
	РисунокШтрихкода.РазмерКартинки = РазмерКартинки.Пропорционально;
	РисунокШтрихкода.ГраницаСверху  = Ложь;
	РисунокШтрихкода.ГраницаСлева  	= Ложь;
	РисунокШтрихкода.ГраницаСнизу  	= Ложь;
	РисунокШтрихкода.ГраницаСправа  = Ложь;
	
	Возврат ТабДок;

КонецФункции // ПолучитьШК()

Функция ПолучитьТаблицуНаименовнаия(ДанныеОбразца, СтруктрураОбъеденненыхЯчеек, стПараметровОбласти, мШиринаКолонок, СтркутураНастроекПечати)
	
	ПоискРазмера = Истина;
	РазмерНайден = Ложь;
	ПоследнийРаз = Ложь;
	
	Пока ПоискРазмера Цикл
		
		Если ПоследнийРаз Тогда
			ПоискРазмера = Ложь;
		КонецЕсли;
		
		ТабДок = Новый ТабличныйДокумент;
		омТабличныйДокументКлиентСервер.УстановитьШиринуКолонок(ТабДок, мШиринаКолонок);
		Область = омТабличныйДокументКлиентСервер.СформироватьОбластьТабличногоДокумента(ТабДок, стПараметровОбласти);	
		ВысотаПустойОбласти = ВысотаОбластиВмм(Область, ТабДок);
		Область.Текст 		= СтркутураНастроекПечати.ТекстНаименование;
		
		Если НЕ ПоследнийРаз Тогда
			
			ВысотаСТекстом = ВысотаОбластиВмм(Область, ТабДок);
			
			Если ВысотаПустойОбласти < ВысотаСТекстом Тогда
				СтруктрураОбъеденненыхЯчеек.Наименование = СтруктрураОбъеденненыхЯчеек.Наименование + 1;
				Если СтруктрураОбъеденненыхЯчеек.Наименование > СтруктрураОбъеденненыхЯчеек.МаксимальнаяШирина Тогда
					Прервать;	
				КонецЕсли;
				Если РазмерНайден Тогда
					ПоследнийРаз = Истина;
				КонецЕсли;
			Иначе
				Если СтруктрураОбъеденненыхЯчеек.Наименование = 1 Тогда
					Прервать;	
				КонецЕсли;
				РазмерНайден = Истина;
				СтруктрураОбъеденненыхЯчеек.Наименование = СтруктрураОбъеденненыхЯчеек.Наименование - 1;
			КонецЕсли;
			
			стПараметровОбласти.ДлинаОбласти = СтруктрураОбъеденненыхЯчеек.Наименование;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабДок;

КонецФункции // ПолучитьТаблицуНаименовнаия()

Функция ВысотаОбластиВмм(пОбласть, пТабДок)
    
    Надпись = пТабДок.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);    
    Надпись.Расположить(пОбласть);    
    Высота = Надпись.Высота;    
    пТабДок.Рисунки.Удалить(Надпись);
    
    Возврат(Высота);
    
КонецФункции

Процедура ЗаписатьВариантНастройки(ВариантНастройки, ИмяВарианта) Экспорт

	Префикс = ПолучитьПрефикс();
	ПустойПользователь = Справочники.Пользователи.ПустаяСсылка();
	
	НомерНастройки = ПолучитьНомерВарианта(ИмяВарианта);
	
	Если НомерНастройки = Неопределено Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЕСТЬNULL(МАКСИМУМ(НастройкиПроекта.НомерНастройки), 0) КАК НомерНастройки
			|ИЗ
			|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
			|ГДЕ
			|	НастройкиПроекта.ИмяНастройки = ""ВариантыНастроекПечатиОбразцов""
			|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НомерНастройки = Выборка.НомерНастройки + 1;
			
			НаборЗаписей = РегистрыСведений.НастройкиПроекта.СоздатьНаборЗаписей();                                               		НаборЗаписей.Отбор.ИмяНастройки.Установить("ВариантыНастроекПечатиОбразцов");
			НаборЗаписей.Отбор.НомерНастройки.Установить(НомерНастройки);
			НаборЗаписей.Отбор.Пользователь.Установить(ПустойПользователь);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			
			НоваяЗапись.ИмяНастройки 	= "ВариантыНастроекПечатиОбразцов";
			НоваяЗапись.НомерНастройки 	= НомерНастройки;
			НоваяЗапись.Пользователь 	= ПустойПользователь;
			НоваяЗапись.Значение 		= ИмяВарианта;
			
			НаборЗаписей.Записать();
			
		КонецЦикла;
		
	КонецЕсли; 
	
	НаборЗаписей = РегистрыСведений.НастройкиПроекта.СоздатьНаборЗаписей();
	
	Для каждого х Из ВариантНастройки Цикл
		
		Если НЕ х.Ключ = "ТекстНаименование" Тогда
			
			МенеджерЗаписи = РегистрыСведений.НастройкиПроекта.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ИмяНастройки 	= Префикс + х.Ключ;
			МенеджерЗаписи.НомерНастройки 	= НомерНастройки;
			МенеджерЗаписи.Пользователь 	= ПустойПользователь;
			МенеджерЗаписи.Значение 		= х.Значение;
			
			МенеджерЗаписи.Записать();
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры 

Функция ПолучитьНомерВарианта(ИмяВарианта)

	НомерНастройки = Неопределено;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.НомерНастройки КАК НомерНастройки
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = ""ВариантыНастроекПечатиОбразцов""
		|	И (ВЫРАЗИТЬ(НастройкиПроекта.Значение КАК СТРОКА(100))) = &ИмяВарианта
		|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ИмяВарианта", ИмяВарианта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НомерНастройки = Выборка.НомерНастройки;
	КонецЦикла;
	
	Возврат НомерНастройки;

КонецФункции // ПолучитьНомерВырианта()


Процедура УдалитьВариантНаСервере(ИмяВарианта) Экспорт

	НомерНастройки = ПолучитьНомерВарианта(ИмяВарианта);
	
	Если НомерНастройки = Неопределено Тогда
	
		Возврат;	
	
	КонецЕсли; 
	
	ПустойПользователь = Справочники.Пользователи.ПустаяСсылка();
	
	МенеджерЗаписи = РегистрыСведений.НастройкиПроекта.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмяНастройки 	= "ВариантыНастроекПечатиОбразцов";
	МенеджерЗаписи.НомерНастройки 	= НомерНастройки;
	МенеджерЗаписи.Пользователь 	= ПустойПользователь;
	
	МенеджерЗаписи.Удалить(); 
	
	Для каждого ИмяНастройки Из ПолучитьМассивНастроекПечатьОбразца() Цикл
	
		МенеджерЗаписи = РегистрыСведений.НастройкиПроекта.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИмяНастройки 	= ИмяНастройки;
		МенеджерЗаписи.НомерНастройки 	= НомерНастройки;
		МенеджерЗаписи.Пользователь 	= ПустойПользователь;
		
		МенеджерЗаписи.Удалить(); 
		
	КонецЦикла;
	
	

КонецПроцедуры
